app/Helpers/funcao_helper.php

            $path = base_url() . "/file/$model->table/$nome5";
            $db->query("UPDATE $model->table SET $campo5 = '$path' WHERE `id` = $id");
        }
        $auditoria->save([
            'accao' => 'Inserir',
            'processo' => $precesso,
            'registo' => $id,
            'utilizador' => $criadopor,
            'dataAcao' => date('Y-m-d H:i:s'),
            'dataExpiracao' => date('Y-m-d H:i:s', strtotime('+2 years', strtotime(date('Y-m-d H:i:s')))),
        ]);
---
INSERT INTO `auditoria` (`accao`, `processo`, `registo`, `utilizador`, `dataAcao`, `dataExpiracao`) VALUES ('Actualizar', 'Update funcionarios', '3', '1', '2023-04-25', '2025-04-25 01:37:50')

function deletarnormal($id, $db, $model, $criadopor, $auditoria)
{
    $query = $db->query("DELETE FROM $model->table WHERE `id` = " . $id);
    if ($query) {
        $auditoria->save([
            'accao' => 'Deletar',
            'processo' => 'Deletar ' . $model->table,
            'registo' => $id,
            'utilizador' => $criadopor,
            'dataAcao' => date('Y-m-d'),
            'dataExpiracao' => date("Y-m-d H:i:s", strtotime("+2 years", strtotime(date("Y-m-d H:i:s")))),
        ]);
---
INSERT INTO `auditoria` (`accao`, `processo`, `registo`, `utilizador`, `dataAcao`, `dataExpiracao`) VALUES ('Actualizar', 'Actualizar Utilizador', '5', '1', '2023-04-25', '2025-04-25 01:37:50')